SEED_LOCATIONS = [
    {
        "name": "Россия",
        "alias": "russia",
        "type": "country",
        "locations": [
            {"name": "Москва", "alias": "moscow", "type": "city"},
            {"name": "Санкт-Петербург", "alias": "saint-petersburg", "type": "city"},
            {"name": "Новосибирск", "alias": "novosibirsk", "type": "city"},
            {"name": "Екатеринбург", "alias": "ekaterinburg", "type": "city"},
            {"name": "Казань", "alias": "kazan", "type": "city"},
        ],
    },
    {
        "name": "США",
        "alias": "usa",
        "type": "country",
        "locations": [
            {"name": "New-York", "alias": "new-york", "type": "city"},
            {"name": "Los-Angeles", "alias": "los-angeles", "type": "city"},
            {"name": "Miami", "alias": "miami", "type": "city"},
        ],
    },
    {
        "name": "Германия",
        "alias": "germany",
        "type": "country",
        "locations": [{"name": "Berlin", "alias": "berlin", "type": "city"}],
    },
    {
        "name": "Япония",
        "alias": "japan",
        "type": "country",
        "locations": [{"name": "Токио", "alias": "tokyo", "type": "city"}],
    },
]


TRANSLIT_MAP = {
        'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ё': 'e', 'ж': 'zh',
        'з': 'z', 'и': 'i', 'й': 'i', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o',
        'п': 'p', 'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'kh', 'ц': 'ts',
        'ч': 'ch', 'ш': 'sh', 'щ': 'shch', 'ъ': '', 'ы': 'y', 'ь': '', 'э': 'e', 'ю': 'yu',
        'я': 'ya'
    }


NAMES_ONE = [
    "Кудрявый", "Болотный", "Хрюкающий", "Брыкающийся", "Ржавый",
    "Самозабвенный", "Сомнительный", "Сомневающийся", "Слабоумный", "Слаботочный",
    "Скромный", "Всесильный", "Могучий", "Трезвый", "Глумливый",
    "Стабильный", "Колбасный", "Конфетный", "Шоколадный", "Сырный",
    "Крапивный", "Бегущий", "Мятый", "Великий", "Тихий",
    "Добровольный", "Электрический", "Нефритовый", "Нефтяной", "Кирпичный",
    "Кропотливый", "Речной", "Морской", "Умеренный", "Дикий",
    "Полусухой", "Полузабытый", "Полуразрушенный", "Сладковатый", "Стремящийся",
    "Бодрый", "Бодрящий", "Неплохой", "Мокрый", "Опасный",
    "Облезший", "Румяный", "Зеленый", "Заочковавший", "Очкошный",
    "Достопочтенный", "Уставший", "Отдохнувший", "Дружелюбный", "Печальный",
    "Полускошенный", "Подсушеный", "Подтянутый", "Сатирический", "Странный",
    "Сухой", "Тройной", "Красивый", "Жестокий", "Липкий",
    "Соседский", "Кошачий", "Собачий", "Треугольный", "Краеугольный",
    "Современный", "Логичный", "Темный", "Волшебный", "Яркий",
    "Круглый", "Теневой", "Тщеславный", "Миролюбивый", "Воинственный",
    "Осмысленный", "Яростный", "Незаметный", "Независимый", "Безопасный",
    "Легкомысленный", "Вспыльчивый", "Огнеопасный", "Замороженный", "Закольцованный",
    "Ветреный", "Штормовой", "Домашний", "Бронзовый", "Крадущийся",
    "Трудящийся", "Трудолюбивый", "Трещащий", "Тарелочный", "Обманчивый",
]

NAMES_TWO = [
    "тигр", "всадник", "лучник", "пчеловод", "гвоздь",
    "пират", "моряк", "наемник", "терминатор", "одноклеточник",
    "кулинар", "пекарь", "золотник", "сапожник", "гриб",
    "картежник", "чернокнижник", "лесоповалец", "оборотень", "ленивец",
    "штопор", "кот", "дикарь", "слизняк", "морж",
    "заморец", "штопанец", "подсвинок", "барашек", "пятачок",
    "банан", "робот", "бык", "бочонок", "теленок",
    "винни-пух", "мухо-жук", "сомелье", "кропивник", "бессовестник",
    "рысь", "осетр", "лосось", "молоток", "шуруп",
    "советник", "открыватель", "закрыватель", "выключатель", "перетаскиватель",
    "поезд", "туман", "чемодан", "полиглот", "полиморф",
    "затаскиватель", "заискиватель", "зарплатосчет", "фасовщик", "златоус",
    "эктоморф", "мезоморф", "звездочет", "шахтер", "чемпион",
    "дым", "фалафель", "тунец", "вишнеед", "щипатель",
    "любитель", "зверобой", "механик", "свидетель", "разговор",
    "медвежатник", "затворщик", "смешиватель", "расщепитель", "щепоточник",
    "переход", "регресс", "груз", "ритм", "договор",
    "относитель", "сад", "лес", "парк", "луг",
    "самокат", "соавтор", "владелец", "ресторатор", "узурпатор",
    "клен", "дуб", "ниф-ниф", "наф-наф", "нуф-нуф",
]

AGREEMENT_TYPES = ["ДДУ", "Купли-продажи", "Цессии"]

PAYMENT_TYPES = ["Ипотека", "Субсидии", "Материнский капитал"]
